// 1)--------------------------------------------------------

// let i = 0;

// while( i < 3) {
//     alert( `number ${i}!` );
//     i++;
//     };

// 2)--------------------------------------------------------

// let arr = [1, 3, 4, 6, 9, 11, 24, 17];

// for (let i = 0; i < arr.length; i++) {
//     let isPrime = true;
//     for (let j = 2; j < arr[i]; j++) {
//         if (arr[i] % j === 0) {
//             isPrime = false;
//             break;
//         }
//     }
//     if (arr[i] > 1 && isPrime) {
//         console.log(arr[i]);
//     }
// }

// 3)--------------------------------------------------------

// let arr = [1, 3, 4, 6, 9, 11, 24, 17].reverse();
// console.log(arr);

// 4)--------------------------------------------------------

// let i = 3;

// while (i<=7) {
//     console.log(i);
//     i++;    
// }

// 5)--------------------------------------------------------

// let array = [1, 3, 5, 7, 8, 10, 11];

// for (let i = 0; i < array.length; i++) {
//         if (array[i] % 2 === 0) {
//             console.log("Первое четное число в массиве: " + array[i]);
//             break
//         } 
//     }
    


// findFirstEvenNumber(array);


// 6)--------------------------------------------------------

// for (let i = 1; i <= 10; i++) {
//     if (i!=5) {
//         console.log(i);
//     }
    
// }